import re

pattern = r'[а-яА-Я]*[аоуыэяёюиеАОУЫЭЯЁЮИЕ]{2}[a-яА-Я]* [аоуыэяёюиеАОУЫЭЯЁЮИЕ]*[^аоуыэяёюиеАОУЫЭЯЁЮИЕ]?[аоуыэяёюиеАОУЫЭЯЁЮИЕ]*[^аоуыэяёюиеАОУЫЭЯЁЮИЕ]?[аоуыэяёюиеАОУЫЭЯЁЮИЕ]*[^аоуыэяёюиеАОУЫЭЯЁЮИЕ]?[аоуыэяёюиеАОУЫЭЯЁЮИЕ]* '

def test(regex):
    m = (re.findall(pattern, regex + ' '))
    for i in range(len(m)):
        if i < len(m) - 1:
            print((m[i].split(' '))[0], end=' ')
        else:
            print((m[i].split(' '))[0])
        

test("Кривошеее существо гуляет по парку")
test("аа ббб оо ввв ее бббб")
test("Предел функции по Коши и по Гейне")
test("Замечание о дополнении одного из свойств (с доказательством).")
test("Теорема о влиянии неравенства между пределами функций на неравенство между функциями.")
