--Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
--у которых средняя оценка больше минимальной оценк(е|и) в группе 3100.

SELECT "Н_ВЕДОМОСТИ"."ЧЛВК_ИД",
       AVG(CASE
               WHEN ("ОЦЕНКА" <> 'зачет' AND "ОЦЕНКА" <> 'осв' AND "ОЦЕНКА" <> 'незач' AND "ОЦЕНКА" <> 'неявка')
                   THEN CAST("ОЦЕНКА" AS INTEGER) END) AS "СР_ОЦЕНКА",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО"
FROM "Н_ВЕДОМОСТИ"
         JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
         JOIN "Н_ЛЮДИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
GROUP BY "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
HAVING AVG(CASE
               WHEN ("ОЦЕНКА" <> 'зачет'
                   AND "ОЦЕНКА" <> 'осв'
                   AND "ОЦЕНКА" <> 'незач'
                   AND "ОЦЕНКА" <> 'неявка')
                   THEN CAST("ОЦЕНКА" AS INTEGER)
    END) > (SELECT MIN("ОЦЕНКИ_3100"."МИНИМАЛЬНЫЕ")
             FROM (SELECT MIN(CASE
                                  WHEN ("Н_ВЕДОМОСТИ"."ОЦЕНКА" <> 'зачет' AND
                                        "Н_ВЕДОМОСТИ"."ОЦЕНКА" <> 'осв' AND
                                        "Н_ВЕДОМОСТИ"."ОЦЕНКА" <> 'незач' AND
                                        "Н_ВЕДОМОСТИ"."ОЦЕНКА" <> 'неявка')
                                      THEN CAST("ОЦЕНКА" AS INTEGER) END) AS "МИНИМАЛЬНЫЕ"
                   FROM "Н_УЧЕНИКИ"
                            RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
                   WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3100'
                   GROUP BY "Н_УЧЕНИКИ"."ЧЛВК_ИД") AS "ОЦЕНКИ_3100");